Q1. List any five functions of the pandas library with execution

SOL(1):-
1.Series

2.DataFrame

3.read_csv()

4.head() and tail()

5.describe()

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
#SOL(2):-
import pandas as pd
df=pd.DataFrame({'A':[2,334,3],'B':[25,4,4],'C':[2,5.3,334]},index=[1,3,5])

In [7]:
df

     A   B      C
1    2  25    2.0
3  334   4    5.3
5    3   4  334.0

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60

In [53]:
import pandas as pd
df=pd.DataFrame({'value':[10, 20, 30, 40, 50]})

In [54]:
def sum_dataframe():
    return df['value'][0]+df['value'][1]+df['value'][2]

In [55]:
 sum_dataframe()

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
'Word_Count' that contains the number of words in each row of the 'Text' column

In [31]:
import pandas as pd
df=pd.DataFrame({'Text':['tiger','lion','horse']})
df

    Text
0  tiger
1   lion
2  horse

In [33]:
df['Text'][0]

'tiger'

In [34]:
def words():
    d=[]
    for i in range(len(df)):
        p=df['Text'][i]
        t=len(p)
        d.append(t)
    return d
words()

[5, 4, 5]

In [35]:
df['word_count']=words()

In [36]:
df

    Text  word_count
0  tiger           5
1   lion           4
2  horse           5

Q5. How are DataFrame.size() and DataFrame.shape() different?
SOL(5):- size function returns the number of rows present in dataframe and shape function provide the number of rows and column present in dataframe.

Q6. Which function of pandas do we use to read an excel file?

SOL(6):- df=pd.read_excel('file.exel')

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the 
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
function should extract the username from each email address and store it in the new 'Username' 
column.

In [37]:
#SOL(7):-
import pandas as pd
df=pd.DataFrame({'email':[ 'username@domain.com', 'john.doe@example.com']})
df

                  email
0   username@domain.com
1  john.doe@example.com

In [38]:
df['email'][0]

'username@domain.com'

In [39]:
def user():
    p=[]
    for i in range(len(df)):
        a=df['email'][i]
        b=a.split('@')
        p.append(b[0])
    return p
user()

['username', 'john.doe']

In [40]:
df['Username']=user()

In [41]:
df

                  email  Username
0   username@domain.com  username
1  john.doe@example.com  john.doe

Q8.

In [1]:
import pandas as pd
df=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [2]:
a=list(df.columns)
len(a)

3

In [3]:
df[a[0]][0]

3

In [4]:
def sel_rows():
    rem=[]
    for i in range(1):
        for j in range(len(df)):
            if(df[a[i]][j]<5):
                rem.append(j)
    return rem

In [5]:
sel_rows()

[0, 3]

In [6]:
df.drop(sel_rows(),axis=0)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
median, and standard deviation of the values in the 'Values' column

In [15]:
import pandas as pd
a=pd.DataFrame({'values':[1,21,31,4,5,60]})

In [16]:
b=list(a.columns)

In [17]:
def mean1():
    return a['values'].mean()

In [18]:
mean1()

20.333333333333332

In [19]:
def median1():
    return a['values'].median()
median1()

13.0

In [24]:
def std1():
    return a['values'].std()

std1()

22.64214359698893

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [1]:
import pandas as pd
a=pd.date_range(start='2023-03-18',end='2023-03-24')

In [2]:
a

DatetimeIndex(['2023-03-18', '2023-03-19', '2023-03-20', '2023-03-21',
               '2023-03-22', '2023-03-23', '2023-03-24'],
              dtype='datetime64[ns]', freq='D')

In [3]:
a=pd.DataFrame({'date':a})

In [4]:
a

        date
0 2023-03-18
1 2023-03-19
2 2023-03-20
3 2023-03-21
4 2023-03-22
5 2023-03-23
6 2023-03-24

In [5]:
a['sales']=[20,60,40,38,34,23,34]
a['MovingAverage']=a['sales'].rolling(window=7).mean()

In [6]:
a

        date  sales  MovingAverage
0 2023-03-18     20            NaN
1 2023-03-19     60            NaN
2 2023-03-20     40            NaN
3 2023-03-21     38            NaN
4 2023-03-22     34            NaN
5 2023-03-23     23            NaN
6 2023-03-24     34      35.571429

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
Monday, Tuesday) corresponding to each date in the 'Date' column

In [1]:
import pandas as pd
a=pd.date_range(start='2023-01-01',end='2023-01-05')

In [2]:
b=pd.DataFrame({'dates':a})
b['weekdays']=['Sunday','Monday','Tuesday','Wednesday','Thursday']

In [3]:
b

       dates   weekdays
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
function to select all rows where the date is between '2023-01-01' and '2023-01-31'

In [1]:
import pandas as pd
a=pd.date_range(start='2023-01-01',end='2023-01-31')

In [3]:
df=pd.DataFrame({'dates':a})
df

        dates
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

In [ ]:
def ti():
    a=[]

In [ ]:
df['timestamp']=

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
be imported.

ANS:-we can say that the main and first liberary is pandas beacause it contains 
lots of functions and methods.